/* eslint-disable max-len */
import { Language } from '^/types';

export default {
  mainTitle: {
    [Language.KO_KR]: '테스트 서비스 이용약관',
  },
  contentBlocks: [
    {
      title: {
        [Language.KO_KR]: '',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `본 약관은 주식회사 엔젤스윙(이하 ‘회사’이라 함)과 테스트 서비스 이용자 사이의 이용계약입니다.
        테스트 서비스 이용계약은 테스트 계정을 사용하여 본 테스트 서비스를 이용하는 데 동의하는 것입니다. 따라서 이 테스트 이용약관에 동의하지 않으면 테스트 계정을 사용할 수 없습니다. 테스트 계정은 플랫폼 테스트 목적으로만 사용 가능합니다.`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제1조 목적',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: '본 약관은 회사가 운영하는 웹 기반 플랫폼(이하 ‘플랫폼’이라 함)에서 제공하는 테스트 서비스(이하 “서비스”라 함)를 이용함에 있어 플랫폼과 이용자의 권리, 의무 및 책임사항, 서비스 이용조건 및 절차 등 기본적인 사항을 규정함을 목적으로 합니다.',
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제2조 회사의 의무',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `①	테스트 서비스는 회사에서 제공하는 공식 서비스가 아니라 이용자의 구매 결정 전 서비스의 만족도를 확인하기 위하여 회사가 무료로 제공하는 서비스입니다. 이를 위하여 회사는 이용자에게 이메일 등을 통해 테스트 기간을 비롯한 테스트 안내 내용을 알립니다.
        ②	테스트 서비스의 내용은 회사가 제공하는 공식 서비스의 내용과 일부 차이가 있을 수 있습니다.
        ③	회사는 테스트 서비스와 관련하여 문제가 발생하였을 경우 신속하게 해결해야 할 의무가 있습니다. 다만, 처리가 곤란하거나 지연될 경우 적절한 방법을 이용하여 이용자에게 이를 공지할 수 있습니다.
        ④	회사는 테스트 계정 제공과 관련하여 취득한 이용자의 정보를 본인의 사전 승인 없이 어떠한 목적으로도 사용할 수 없습니다. 단, 전기통신관련법령 등 관계법령에 의하여 관련 국가기관 등의 요구가 있는 경우에는 그러지 아니합니다.`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제3조 이용자의 의무',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `①	이용자는 관계법령 및 본 약관의 규정을 비롯하여 회사가 통지하는 사항 등을 준수하여야 하며, 회사의 업무에 방해가 되는 행위 및 회사의 명예를 손상시키는 행위를 하지 않습니다.
        ②	이용자는 테스트 서비스 기간 중 회사로부터 제공받은 별도의 피드백 시트를 통해 운영자에게 테스트 서비스에 대한 피드백을 제공하여야 할 의무가 있습니다.
        ③	이용자는 본인 계정 관리에 최선을 다하여야 합니다. 이용자의 아이디(ID) 등 개인 정보의 관리 책임은 이용자 본인에게 있으며 관리 소홀, 본인의 과실로 인하여 계정 정보가 유출 또는 도용되거나 이로 인해 발생하는 테스트 서비스 이용상의 손해, 또는 타인에 의한 부정 사용 등의 결과에 대해서는 회사가 책임지지 않습니다.
        ④	이용자는 회사에서 제공하는 테스트 서비스를 본래의 목적으로만 사용해야 하며, 테스트 서비스를 통해서 습득한 플랫폼의 내용, 스크린샷 및 기타 제반 사항에 대해서, 회사의 허락없이 무단으로 유포하거나 사용할 수 없습니다.`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제4조 이용권 종료',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: '테스트 서비스의 이용권은 회사가 미리 정한 일정에 따라 종료됩니다. 회사는 필요한 경우 언제든지 이 이용권을 종료시킬 수 있으며 이에 대한 법적 책임은 지지 않습니다.',
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제5조 사용의 제한',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `다음과 같은 경우 테스트 계정의 사용이 제한됩니다.
        1.	공공질서 또는 미풍양속을 저해하거나, 저해할 목적으로 신청한 경우
        2.	부정한 용도로 본 플랫폼을 이용하고자 하는 경우
        3.	영리를 추구할 목적으로 본 플랫폼을 이용하고자 하는 경우
        4.	본 계약에서 명시한 목적 외에 다른 목적으로 사용하는 경우
        5.	회사의 허가 없이 테스트 계정을 배포하는 경우
        6.	기타 부적절한 행위를 할 우려가 있다고 인정되는 경우`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제6조 책임의 한계',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `①	회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 테스트 서비스를 제공할 수 없는 경우에는 테스트 서비스 제공에 관한 책임이 면제됩니다.
        ②	회사는 이용자의 귀책사유로 인한 테스트 서비스의 이용불가 또는 이용장애에 대하여는 책임을 지지 아니하며, 기간통신사업자가 전기통신서비스를 중지하거나 정상적으로 제공하지 아니하여 이용자에게 손해가 발생한 경우에는 책임이 면제됩니다.
        ③	회사는 이용자가 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
        ④	회사는 무료로 제공되는 서비스 이용과 관련하여 관련법령에 특별한 규정이 없는 한 책임을 지지 않습니다.`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제7 조 권리의 귀속',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `①	회사는 테스트 서비스 기간 동안 플랫폼에 대한 이용자의 비독점적인 사용권을 허가합니다.
        ②	이 플랫폼의 사용권은 오로지 플랫폼을 사용할 권리를 의미하는 것이며, 이용자는 이 플랫폼상에서 생성 또는 취득한 콘텐츠와 관련하여 소유권이나 저작권 등 지적재산권을 주장할 수 없습니다. 이 플랫폼을 타인에게 어떤 목적으로도 재판매하거나 임대할 수 없습니다.
        ③	이 플랫폼과 모든 부속물(콘텐츠 포함)에 대한 소유권과 저작권 등 지적재산권은 회사가 가지고 있으며, 이 권리는 대한민국 저작권법과 국제 저작권 조약에 의하여 보호됩니다.`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제8조 손해배상',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `①	이용자가 본 약관의 규정을 위반함으로 인하여 또는 이용자가 서비스의 이용과 관련하여 회사에 손해를 입힌 경우 이용자는 회사에 대하여 그 손해를 배상하여야 합니다.
        ②	이용자가 서비스를 이용함에 있어 행한 불법행위나 본 약관 위반행위로 인하여 회사가 당해 이용자 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 이용자는 자신의 책임과 비용으로 회사를 면책시켜야 하며, 회사가 면책되지 못한 경우 당해 이용자는 그로 인하여 회사에 발생한 모든 손해를 배상하여야 합니다.`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '제9 조 준거법 및 관할법원',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `①	서비스 이용과 관련하여 회사와 이용자 간에 이견 또는 분쟁이 있는 경우, 양당사자 간의 합의에 의해 원만히 해결하여야 합니다.
        ②	이 약관의 해석 및 회원 간의 분쟁에 대하여는 대한민국의 법령을 준거법으로 합니다.
        ③	회사와 회원 간 발생한 분쟁에 관한 소송은 서울중앙지방법원을 전속관할로 합니다.`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '- 부칙 -',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: '이 약관은 2019년 1월 24일부터 시행됩니다.',
        [Language.EN_US]: '',
      },
    },
  ],
};
