/* eslint-disable max-len */
import { Language } from '^/types';

export default {
  mainTitle: {
    [Language.KO_KR]: '엔젤스윙 서비스 개인정보처리방침',
  },
  contentBlocks: [
    {
      title: {
        [Language.KO_KR]: '',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: '주식회사 엔젤스윙(이하 \'회사\'라 함)은 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 ‘정보통신망법’), 개인정보보호법 등 국내의 개인정보 보호 법령을 철저히 준수하고, 이를 위하여 다음과 같이 개인정보 처리지침을 수립․공개하여, 이용자 권익 보호에 최선을 다하고 있습니다.',
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `본 개인정보처리방침은 회사가 운영하는 엔젤스윙 드론데이터플랫폼(이하 '서비스'라 함) 등 관련 제반 서비스에 적용되며 다음과 같은 내용을 담고 있습니다.
        1. 개인정보의 수집
        2. 개인정보의 이용 목적
        3. 개인정보 보유 및 이용기간
        4. 개인정보의 제공 및 위탁
        5. 개인정보의 열람, 수정, 삭제 및 개인정보의 도용
        6. 개인정보의 파기
        7. 개인정보 자동 수집 장치의 설치, 운영 및 거부에 관한 사항
        8. 회원의 권리와 의무
        9. 개인정보의 기술적/관리적 보호 대책
        10. 개인정보보호책임자 및 담당자의 연락처
        11. 개인정보 처리방침의 개정 및 공지`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '1. 개인정보의 수집',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `모든 이용자는 회사가 제공하는 서비스를 이용할 수 있고, 회원가입을 통해 더욱 다양한 서비스를 제공받을 수 있습니다. 이용자의 개인정보를 수집하는 경우에는 반드시 사전에 이용자에게 해당 사실을 알리고 동의를 구하도록 하겠습니다. 수집방법에는 홈페이지(회원가입), 서비스 이용, 고객센터 상담내용, 문의 이메일, 전화, 서면양식 등이 있습니다. 이용자로부터 수집하고 있는 개인정보는 다음과 같습니다.
        가. 수집되는 개인정보
        1) 홈페이지 회원 가입 및 관리
        가) 필수 정보
        •	로그인 아이디(이메일), 비밀번호
        •	회원의 회사•부서•직책 등 직장정보, 이름, 휴대폰번호•이메일 등 연락처
        •	이용행태, 이용빈도 등 서비스 이용 과정 상의 생성정보
        •	OS 버전, 단말기 정보 등 운영체제 및 하드웨어 환경정보
        나) 선택 정보
        •	프로필 사진, 회원이 입력한 본인의 프로필 정보
        2) 서비스 이용 등
        가) 필수 정보
        •	로그인 아이디(이메일), 비밀번호
        •	회원의 회사•부서•직책 등 직장정보, 이름, 휴대폰번호•이메일 등 연락처
        •	이용행태, 이용빈도 등 서비스 이용 과정 상의 생성정보
        •	OS 버전, 단말기 정보 등 운영체제 및 하드웨어 환경정보
        나) 선택 정보
        •	프로필 사진, 회원이 입력한 본인의 프로필 정보
        3) 서비스 이용 시 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.
        •	IP Address, 쿠키, 기기정보, 방문 일시, 서비스 이용 기록, 불량 이용 기록 등
        
        4) 유료 서비스 이용 과정에서 결제 등을 위하여 불가피하게 필요한 때에는 다음의 정보가 수집될 수 있습니다.
        •	신용카드 결제 시: 카드사명, 카드번호 등
        •	계좌이체 시: 은행명, 계좌번호 등
        
        5) 테스트 이용자의 무료체험을 위하여 다음의 정보가 수집될 수 있습니다.
        •	이름, 회사명, 휴대폰번호•이메일 등 연락처
        
        6) 고객센터를 통하여 상담하는 과정에서 웹페이지, 메일, 팩스, 전화 등을 통해 이용자의 개인정보가 수집될 수 있습니다. 
        
        나. 개인정보의 수집방법
        회사는 다음과 같은 방법으로 개인정보를 수집합니다.
        1) 서비스 가입이나 사용 중 이용자의 자발적 제공을 통한 수집
        2) 기기정보, 서비스 이용 기록 등 생성정보는 서비스 이용과정에서 자동으로 수집`,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '2. 개인정보의 이용 목적',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회사는 다음과 같은 목적으로 이용자 등의 개인정보를 수집합니다. 수집한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전 동의를 구할 예정입니다.

        가.	회원가입 및 회원관리
        •	이용자 식별, 가입의사 확인, 가입 및 가입횟수 제한 등
        •	원활한 의사소통 경로의 확보, 고객 문의에 대한 응답 등
        •	새로운 기능 출시 안내, 공지사항 전달 등
        •	불량회원의 부정이용방지와 비인가 사용방지, 본인확인 및 분쟁 조정을 위한 기록보존, 불만 등 민원처리 등
        
        나. 서비스 기능의 제공
        •	프로젝트 업로드ᆞ관리ᆞ공유, 프로젝트 상의 기능 이용 등 서비스 내에서 회원의 계정을 통하여 이용할 수 있는 서비스 등을 제공
        
        다. 서비스 제공에 관한 계약 이행 및 유료 서비스 제공에 따른 요금정산
        •	이용자와 약속한 서비스 제공, 서비스 구매 및 이용 시 요금 정산
        
        라. 서비스 개선 및 신규 서비스 개발
        •	서비스 방문 및 이용 기록의 분석 등에 기반한 신규 서비스 요소를 발굴하고 기존 서비스의 개선에 이용
        
        마. 맞춤형 서비스 및 오용행위 방지에의 활용
        •	서비스 이용 기록과 접속 빈도 분석, 서비스 이용에 대한 통계, 맞춤형 서비스 제공, 서비스 개선에의 활용 등 
        •	규정된 의무의 이행, 법령이나 이용약관에 반하여 이용자에게 피해를 줄 수 있는 잘못된 이용행위의 방지 등
        
        바. 고충처리
        •	민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락 및 통지, 처리결과 통보
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '3. 개인정보 보유 및 이용기간',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        이용자의 개인정보를 수집 및 이용 목적, 이용 기간에만 제한적으로 이용하고 있으며, 탈퇴를 요청하거나 동의를 철회하는 경우 지체 없이 파기합니다.
        다만 관계법령에 의해 보관해야 하는 정보는 법령이 정한 기간 동안 보관합니다.
        가. 회사 내부 방침에 의한 정보보유
        1) 홈페이지 회원 가입 및 관리 : 사업자/단체 홈페이지 탈퇴시까지 
        다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료시까지 
        가) 관계 법령 위반에 따른 수사․조사 등이 진행중인 경우에는 해당 수사․조사 종료시까지 
        나) 홈페이지 이용에 따른 채권․채무관계 잔존시에는 해당 채권․채무관계 정산시까지 
        
        2) 부정이용기록 보유 : 1년 (부정 이용 방지)
        
        나. 관련 법령에 의한 정보보유
        전자상거래 등에서의 소비자보호에 관한 법률, 통신비밀보호법 등 관련법령의 규정에 의하여 일정기간 정보를 보유하여야 할 필요가 있을 경우 회사는 보관하는 정보를 일정기간 보유하며, 보유기간은 아래와 같습니다.
        
        1) 「전자상거래 등에서의 소비자 보호에 관한 법률」에 따른 표시․광고, 계약내용 및 이행 등 거래에 관한 기록 
        - 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년 
        - 소비자 불만 또는 분쟁처리에 관한 기록 : 3년 
        - 표시ᆞ광고에 관한 기록 : 6개월
        
        2) 「통신비밀보호법」에 따른 통신사실확인자료 보관
        - 컴퓨터통신, 인터넷 로그기록자료, 접속지 추적자료 : 3개월
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '4. 개인정보의 제공 및 위탁',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회사는 회원의 개인정보를 '개인정보의 수집 및 이용 목적'에서 명시한 범위에서 사용하며, 회원의 동의 없이 개인정보를 외부에 제공하지 않습니다. 이에 따라 서비스 이용과정에서 다음의 정보가 공개될 수 있습니다. 
        
        가. 개인정보의 공개
        웹서비스 이용 도중 회원의 명함 정보 및 회원이 선택적으로 동의하여 입력한 기타 정보가 연결된 회원 간에 공개될 수 있습니다. 또한 회원이 상대에게 프로젝트를 공유할 경우, 공유자의 식별을 위해 이름, 프로필 사진 등의 일부 정보가 피공유자에게 공개될 수 있습니다.
        
        나. 개인정보의 위탁제공
        회사는 서비스의 향상을 위하여 아래와 같이 개인정보를 위탁하고 있으며, 관련 법령(위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리․감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.)에 따라 위탁계약시 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다. 회사는 수탁자가 변경되는 경우 지체없이 본 개인정보 처리방침을 통하여 공개합니다.
        
        Amazon Web Service
        •	수탁업체명 및 연락처: Amazon Web Service, Inc. (https://aws.amazon.com/compliance/contact/)
        •	위탁업무 및 목적: 데이터 보관 및 시스템 운영
        •	개인정보 이전국가: 대한민국(AWS Seoul Region)
        •	이전되는 개인정보 항목: 서비스 제공 과정에서 수집한 모든 개인정보
        •	개인정보 이전일시: 최초 회원가입 시점 또는 서비스 이용 시점 
        •	개인정보 이전방법: AWS 클라우드 컴퓨팅 환경에 개인정보 보관
        •	개인정보 보유, 이용기간: 개인정보 보관기간 동안 개인정보가 보관된 클라우드 서버를 운영 및 관리
        
        회사는 위에 명시된 항목을 제외한 이용자의 개인정보를 원칙적으로 외부에 공개하지 않습니다. 단, 법령 규정에 의거하거나 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우 또는 이용자의 동의가 있는 경우는 예외로 합니다. 또한 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우에는 특정 개인을 알아볼 수 없는 통계 자료의 형태로 가공하여 제공할 수 있습니다.

        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '5. 개인정보의 열람, 수정, 삭제 및 개인정보의 도용',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회원은 언제든지 자신의 개인정보를 열람, 공개 및 비공개 처리하거나 수정할 수 있으며, 삭제 및 파기를 요청할 수 있습니다.
        
        가. 개인정보의 열람 및 수정 요청
        1) 회원은 언제든지 등록되어 있는 본인의 개인정보를 조회, 수정할 수 있습니다. 회원은 당해 개인정보의 조회, 수정을 위하여 서비스의 마이페이지를 클릭하여 계정 등 등록된 개인정보를 직접 열람하거나 수정할 수 있습니다.
        
        2) 이용자가 만 14세 미만 미성년자인 경우에는 법정대리인(부모 등)이 미성년자의 개인정보를 조회하거나 수정할 권리, 수집 및 이용 동의를 철회할 권리를 가집니다.
        
        나. 개인정보의 삭제(회원탈퇴)
        회원이 회원탈퇴를 원하는 경우, 웹사이트로 로그인한 후 'MYPAGE-Delete Account'를 통해 직접 탈퇴할 수 있습니다. 만일, 직접 탈퇴가 어려운 경우 개인정보관리담당자에게 전화 또는 이메일로 연락하시면 지체없이 조치를 취하겠습니다.
        
        다. 개인정보의 도용
        회사는 타인의 휴대폰 번호, 이메일 주소, 소속기관 등 아이디 또는 기타 개인정보를 도용하여 회원가입한 자 또는 서비스를 이용한 자를 발견한 경우 지체 없이 해당 아이디에 대한 서비스 이용 정지 또는 회원 탈퇴 등 필요한 조치를 취합니다.
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '6. 개인정보의 파기',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회원의 개인정보는 원칙적으로 개인정보의 수집 및 이용 목적이 달성되면 지체 없이 파기합니다. 회사의 개인정보 파기절차 및 방법은 다음과 같습니다.

        가. 파기절차
        회원이 서비스 가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB 또는 보관 장소로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(개인정보 보유 및 이용기간 참조) 일정 기간 저장된 후 파기됩니다. 위 별도 보관된 개인정보는 정해진 목적 이외의 다른 목적으로 이용되지 않습니다.
        
        나. 파기기한
        이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.
        
        다. 파기방법
        종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다. 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '7. 개인정보 자동 수집 장치의 설치, 운영 및 거부에 관한 사항',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회사는 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용합니다. 쿠키란 웹사이트 접속시 이용자의 저장장치에 전송하는 특별한 텍스트 파일(text file)을 말하며, 웹사이트의 서버(server)에서만 읽어들일 수 있는 형태로 전송되어 개인이 사용하는 브라우저(browser)의 디렉터리(directory) 하위에 저장됩니다. 모바일 애플리케이션과 같이 쿠키 기술을 사용할 
        수 없는 경우에는 쿠키와 유사한 기능을 수행하는 기술(광고식별자 등)을 사용할 수도 있습니다.
        
        가. 쿠키의 사용 목적
        이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.
        
        나. 쿠키 설정 거부
        이용자는 쿠키에 대한 선택권을 가지고 있습니다. 웹 브라우저 옵션(option)을 선택함으로써 모든 쿠키의 허용, 동의를 통한 쿠키의 허용, 모든 쿠키의 차단을 스스로 결정할 수 있습니다. 단, 쿠키 저장을 거부할 경우에는 로그인이 필요한 일부 서비스를 이용하지 못할 수도 있습니다.
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '8. 회원의 권리와 의무',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회원은 개인정보를 보호받을 권리와 함께 스스로를 보호하고 타인의 정보를 침해하지 않을 의무도 가지고 있습니다. 비밀번호를 포함한 회원의 개인정보가 유출되지 않도록 조심하시고 게시물을 포함한 타인의 개인정보를 훼손하지 않도록 유의해 주십시오.

        회원이 입력한 부정확한 정보로 인해 발생하는 사고의 책임은 이용자 자신에게 있습니다. 회원은 개인정보를 최신의 상태로 정확하게 입력하여 불의의 사고를 예방하여야 할 의무가 있습니다.
        
        회원이 위 책임을 다하지 못하고 타인의 정보 및 존엄성을 훼손할 시에는 『정보통신망 이용촉진 및 정보보호 등에 관한 법률』등 관련 법률에 의해 처벌받을 수 있습니다.
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '9. 개인정보의 기술적/관리적 보호 대책',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회사는 개인정보보호법 제 29조에 따라 이용자의 소중한 개인정보 보호를 위해 다음의 노력을 하고 있습니다.
        가.	개인정보처리 직원의 최소화 및 교육
        개인정보를 취급하는 직원을 담당자에 한정시키고 있고, 담당자에 대한 수시 교육을 통하여 회사의 개인정보처리방침의 준수를 항상 강조하고 있습니다. 
        
        나.	해킹 등에 대비한 기술적 대책
        회사는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다. 회원의 개인정보나 자료가 유출되거나 손상되지 않도록 방지하고 있으며, 암호화 통신 등을 통하여 네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다. 
        
        다.	개인정보의 암호화
        이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.
        
        라.	접속기록의 보관 및 위변조 방지
        개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '10. 개인정보보호책임자 및 담당자의 연락처',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        귀하께서는 회사의 웹서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보보호책임자 혹은 담당부서로 신고하실 수 있습니다. 회사는 회원의 신고사항에 대하여 신속하게 답변을 드릴 것입니다.
        
        개인정보보호책임자
        이 름 : 이지선
        소 속 : (주)엔젤스윙
        직 위 : 최고운영책임자
        전 화 : 070-8098-1040
        이메일 : support@angelswing.io
        
        또한 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하셔서 도움을 받으실 수 있습니다. 
        
        •	개인정보침해신고센터 (국번 없이)118  http://privacy.kisa.or.kr
        •	대검찰청 사이버범죄수사단 02-3480-3571  cybercid@spo.go.kr
        •	경찰청 사이버테러대응센터 (국번 없이)182  http://www.ctrc.go.kr
        `,
        [Language.EN_US]: '',
      },
    },
    {
      title: {
        [Language.KO_KR]: '11. 개인정보 처리방침의 개정 및 공지',
        [Language.EN_US]: '',
      },
      content: {
        [Language.KO_KR]: `
        회사는 위 내용에 대한 추가, 삭제 및 수정이 있을 경우에는 시행일 최소 7일 전부터 홈페이지 또는 이용자 개별공지를 통해 공지할 것입니다. 단, 이용자의 소중한 권리 또는 의무에 중요한 변경이 발생하는 경우 최소 30일 전에 공지하도록 하며 필요시 이용자의 동의를 다시 받을 수도 있습니다. 
        
        개인정보 처리방침 공고일자 : 2019년 1월 21일
        개인정보 처리방침 시행일자 : 2019년 01월 24일
        `,
        [Language.EN_US]: '',
      },
    },
  ],
};
